[
  {
    "image": "journey-map.png",
    "alt": "Onboarding journey diagram created within Braze.",
    "title": "Onboarding Journey Redesign",
    "description": "Led the redesign of Coastal’s member onboarding program, transforming a single welcome email into a 30-day, multi-step journey personalized by product type and member actions. Managed project planning, collaboration across departments, and implementation in Braze to improve both branch and digital experiences.",
    "impactList": [
      "Expanded onboarding from 1 to 15+ touchpoints",
      "Increased direct deposit enrollments by 7.7%",
      "Increased e-statement enrollments by 6.4%",
      "Achieved 59% average open rate and 9% click-to-open rate"
    ],
    "skills": "Project Management, Lifecycle Marketing, Journey Mapping"
  },
  {
    "image": "/collaboration.png",
    "alt": "Sarah and a coworker collaborating and mapping marketing communication.",
    "title": "Snowflake Integration",
    "description": "Managed a cross-functional project integrating real-time data from the banking core system into Braze and Snowflake, replacing manual processes with automated workflows that improved campaign reliability, personalization, and overall marketing efficiency.",
    "impactList": [
      "Enabled real-time marketing data access",
      "Enabled automated, personalized member journeys",
      "Reduced manual processes and improved campaign accuracy"
    ],
    "skills": "Project Management, Martech Integration, Data Automation"
  },
  {
    "image": "/protege.jpg",
    "alt": "Sarah standing in front of a slide deck after winning Coastal's interal speech competition.",
    "title": "AI Committee Proposal",
    "description": "Created and presented an internal proposal on ethical AI adoption, which won a company-wide speech competition. The proposal led to the formation of an AI committee and the development of an official AI policy, guiding responsible adoption across the organization.",
    "impactList": [
      "Formation of AI committee",
      "Contributed to creation of company-wide AI policy"
    ],
    "skills": "Strategy Development, Public Speaking"
  }
]
